Repository: pmpr/wp-mdl-woocommerce-gateway
Catalog: translation/*.po
Languages: fa_ir

source: %s gateway settings for woocommerce
fa_ir: تنظیمات درگاه پرداخت %s برای افزونه فروشگاه ساز ووکامرس

source: General Configuration
fa_ir: پیکربندی عمومی

source: Activation
fa_ir: فعال‌سازی

source: To activate this payment gateway, you must check the checkbox.
fa_ir: برای فعالسازی این درگاه پرداخت باید چک باکس را تیک بزنید.

source: Gateway Title
fa_ir: عنوان درگاه

source: The title of the gateway that is displayed to the customer during the purchase.
fa_ir: عنوانی که در طی عملیات پرداخت برای درگاه نمایش داده خواهد شد.

source: Gateway Description
fa_ir: توضیحات درگاه

source: Secure payment by all Shetab member cards through %s.
fa_ir: پرداخت امن به وسیله کلیه کارت های عضو شتاب از طریق %s.

source: Descriptions that will be displayed to the gateway during the payment process.
fa_ir: توضیحاتی که در طی عملیات پرداخت برای درگاه نمایش داده خواهد شد.

source: Gateway Image
fa_ir: تصویر درگاه

source: The image of the gateway that is displayed to the customer during the purchase.
fa_ir: تصویر که هنگام خرید به مشتری نمایش داده می شود.

source: Direct Redirect
fa_ir: هدایت مستقیم به درگاه

source: Enable this option if you want the user to be directed directly to the payment gateway and not click on the preload option on the pre-invoice page.
fa_ir: در صورتی که قصد دارید کاربر مستقیما به درگاه هدایت شود و در صفحه پیش‌فاکتور گزینه پرداخت را کلیک نکند، این گزینه را فعال نمایید.

source: By default (disabling this option) the buyer first sees the order number and the final price before being directed to the portal, and then is directed to the portal by pressing the confirmation button.
fa_ir: به صورت پیشفرض (غیرفعال بودن این گزینه) خریدار قبل از هدایت به درگاه ابتدا شماره سفارش و قیمت نهایی را مشاهده میکند و سپس با زدن دکمه تایید به درگاه هدایت میشود.

source: Payment operation Messages
fa_ir: پیام‌های عملیات پرداخت

source: Connecting Message
fa_ir: پیام در حال اتصال

source: Connecting to the bank...
fa_ir: در حال اتصال به بانک ...

source: The text of the message you want to be displayed to the customer when connecting to the bank.
fa_ir: متن پیامی که می خواهید هنگام اتصال به بانک به مشتری نمایش داده شود.

source: Success Payment Message
fa_ir: پیام پرداخت موفق

source: Thank you, your order is successfully payed.
fa_ir: با تشکر از شما. سفارش شما با موفقیت پرداخت شد.

source: The text of message after successful payment.
fa_ir: متن پیامی که میخواهید بعد از پرداخت موفق به کاربر نمایش دهید را وارد نمایید.

source: Failed Payment Message
fa_ir: پیام پرداخت ناموفق

source: Your payment has failed. Please try again or contact the site administrator if there is a problem.
fa_ir: پرداخت شما انجام نشد. لطفاً دوباره امتحان کنید یا در صورت وجود مشکل با مدیر سایت تماس بگیرید.

source: Enter the text of the message that you want to display to the user after an unsuccessful payment, this error reason is sent from Bank website.
fa_ir: متن پیامی که می خواهید پس از پرداخت ناموفق به کاربر نمایش داده شود را وارد کنید، این دلیل خطا از سایت بانک ارسال می شود.

source: Cancel Payment Message
fa_ir: پیام انصراف از پرداخت

source: The payment remained incomplete due to your cancellation.
fa_ir: به دلیل انصراف شما، پرداخت ناقص باقی ماند.

source: Enter the text of the message you want to display after the user cancels the payment, this message will be displayed after returning from the bank.
fa_ir: پس از انصراف کاربر از پرداخت، متن پیامی که می خواهید نمایش داده شود را وارد کنید، این پیام پس از بازگشت از بانک نمایش داده می شود.

source: Connection Error Message
fa_ir: پیام خطای اتصال

source: Error connecting to the bank, please try again.
fa_ir: خطا در اتصال به بانک، لطفاً دوباره امتحان کنید.

source: The text of the message you want to be displayed to the customer after an error in connecting to the bank.
fa_ir: متن پیامی که می خواهید پس از خطا در اتصال به بانک به مشتری نمایش داده شود.

source: Reversal Done Message
fa_ir: پیام موفقیت بازگشت وجه

source: Your payment has been successfully processed at the bank, but there has been a problem with the service.
fa_ir: پرداخت شما در بانک با موفقیت انجام شده است، اما در ارائه خدمات مشکلی رخ داده است.

source: The order to return the money to your account has been registered in the bank, if the payment is not returned to your account within the next few hours, contact support. (The final time to return to the account is 72 hours)
fa_ir: دستور بازگشت وجه به حساب شما در بانک ثبت شده است، در صورتی که وجه پرداختی تا ساعات آینده به حساب شما بازگشت داده نشد با پشتیبانی تماس بگیرید (نهایت مدت زمان بازگشت به حساب ۷۲ ساعت می باشد)

source: The text of the message you want to be displayed to the customer after reversal payment done.
fa_ir: متن پیامی که پس از انجام عملیات بازگشت وجه می‌خواهید به مشتری نمایش داده شود.

source: Reversal Error Message
fa_ir: پیام خطای بازگشت وجه

source: In order to register the order to return the money to your bank account, but unfortunately it encountered an error, please contact support to receive the service or refund the payment.
fa_ir: به منظور ثبت دستور بازگشت وجه به حساب شما در بانک اقدام شد اما متاسفانه با خطا روبرو شد ، لطفا به منظور دریافت خدمات و یا استرداد وجه پرداختی با پشتیبانی تماس بگیرید.

source: The text of the message you want to be displayed to the customer when error accrued on reversal payment.
fa_ir: متن پیامی که پس از رخداد خطا در عملیات بازگشت وجه، می‌خواهید به مشتری نمایش داده شود.

source: Back
fa_ir: بازگشت

source: Purchase
fa_ir: پرداخت

source: Order ID is not exits
fa_ir: شناسه سفارش وجود ندارد

source: The transaction status has already been specified.
fa_ir: وضعیت تراکنش قبلاً مشخص شده است.

source: The transaction was successful.
fa_ir: معامله با موفقیت انجام شد.

source: Transaction request number
fa_ir: شماره درخواست تراکنش

source: The transaction remained unfinished due to user cancellation.
fa_ir: تراکنش به دلیل لغو کاربر ناتمام ماند.

source: An error occurred while paying.
fa_ir: هنگام پرداخت خطایی روی داد.

source: This transaction has been verified once before.
fa_ir: این تراکنش قبلاً یک بار تأیید شده است.

source: Error cause
fa_ir: دلیل خطا

source: Transaction ID
fa_ir: شناسه تراکنش

source: Error
fa_ir: خطا

source: %s Gateway
fa_ir: درگاه %s

source: Mellat Bank
fa_ir: بانک ملت

source: Bank Account Configuration
fa_ir: پیکربندی حساب بانکی

source: Terminal ID
fa_ir: شماره ترمینال

source: Mellat Bank portal terminal number
fa_ir: شماره ترمینال درگاه بانک ملت

source: Username
fa_ir: نام کاربری

source: Mellat Bank portal username
fa_ir: نام کاربری درگاه بانک ملت

source: Password
fa_ir: گذرواژه

source: Mellat Bank portal password
fa_ir: کلمه عبور درگاه بانک ملت

source: Order Number # %s
fa_ir: شماره سفارش # %s

source: Connecting to the bank .....
fa_ir: در حال اتصال به بانک ...

source: Sale Order ID
fa_ir: شناسه سفارش خرید

source: Failure in connection with the bank.
fa_ir: شکست در ارتباط با بانک.

source: Inventory is not enough.
fa_ir: موجودی کافی نیست.

source: Your second password is incorrect.
fa_ir: رمز دوم شما صحیح نیست.

source: The password enter times is more than threshold.
fa_ir: دفعات مجاز ورود رمز بیش از حد است.

source: Withdraw funds is more than allowed threshold.
fa_ir: دفعات برداشت وجه بیش از حد مجاز است.

source: You have stopped transacting.
fa_ir: شما از انجام تراکنش منصرف شده اید.

source: The card has expired.
fa_ir: تاریخ انقضای کارت گذشته است.

source: Amount is more than allowed threshold.
fa_ir: مبلغ برداشت وجه بیش از حد مجاز است.

source: Invalid card issuer.
fa_ir: صادر کننده کارت نامعتبر است.

source: Card issuer switch error has occurred.
fa_ir: خطای سوییچ صادر کننده کارت رخ داده است.

source: No response was received from the card issuer.
fa_ir: پاسخی از صادر کننده کارت دریافت نشد.

source: The cardholder is not allowed to perform this transaction.
fa_ir: دارنده کارت مجاز به انجام این تراکنش نمی باشد.

source: A security error has occurred.
fa_ir: خطای امنیتی رخ داده است.

source: The user information of the acceptor is not valid.
fa_ir: اطلاعات کاربری پذیرنده معتبر نیست.

source: The format of the entered information is incorrect.
fa_ir: فرمت اطلاعات وارد شده صحیح نیست.

source: Invalid account.
fa_ir: حساب نامعتبر.

source: A system error has occurred.
fa_ir: خطای سیستمی رخ داده است.

source: Invalid date.
fa_ir: تاریخ نامعتبر است.

source: The request number is duplicate.
fa_ir: شماره درخواست تکراری است.

source: There is no such transaction.
fa_ir: چنین تراکنشی وجود ندارد.

source: Verify has already been requested.
fa_ir: قبلا درخواست Verify داده شده است.

source: The transaction is already Settle.
fa_ir: تراکنش قبلا Settle شده است.

source: The transaction is not Settle.
fa_ir: تراکنش Settle نشده است.

source: Settle transaction not found.
fa_ir: تراکنش Settle یافت نشد.

source: The transaction has already been reversed.
fa_ir: تراکنش قبلا Reverse شده است.

source: Refund transaction not found.
fa_ir: تراکنش Refund یافت نشد.

source: The transaction is duplicate.
fa_ir: تراکنش تکراری است.

source: No reference transaction available.
fa_ir: تراکنش مرجع موجود نیست.

source: An error occurred while depositing.
fa_ir: خطا در واریز رخ داده است.

source: Invoice ID is incorrect.
fa_ir: شناسه قبض نادرست است.

source: The payment ID is incorrect.
fa_ir: شناسه پرداخت نادرست است.

source: An error occurred while recording the information.
fa_ir: خطا در ثبت اطلاعات رخ داده است.

source: Invalid payer ID.
fa_ir: شناسه پرداخت کننده نامعتبر است.

source: There was a problem defining the customer information.
fa_ir: اشکال در تعریف اطلاعات مشتری رخ داده است.

source: Excessive data entry is allowed.
fa_ir: تعداد دفعات ورود اطلاعات بیش از حد مجاز است.

source: IP is not valid.
fa_ir: آدرس آی پی معتبر نیست.

source: Parsian Bank
fa_ir: بانک پارسیان

source: Can not load Soap Client
fa_ir: نمی توان Soap Client را اجرا کرد

source: Error on reversal
fa_ir: خطا در برگشت وجه

source: Login Account
fa_ir: شناسه پذیرنده

source: Enter the PIN Code provided by the bank here.
fa_ir: شناسه پذیرنده ای (PIN) که بانک در اختیار شما قرار داده را اینجا وارد کنید.

source: An unknown error has occurred
fa_ir: خطای ناشناخته رخ داده است

source: Transaction reversal is not allowed
fa_ir: برگشت تراکنش مجاز نمی باشد

source: The transaction has already been reversed
fa_ir: برگشت تراکنش قبلا انجام شده است

source: It is not possible to reverse the transaction in the current state
fa_ir: برگشت تراکنش در وضعیت جاری امکان پذیر نمی باشد

source: Saderat Bank
fa_ir: بانک صادرات

source: Terminal ID (TID)
fa_ir: شماره ترمینال (TID)

source: Merchant ID (MID)
fa_ir: شماره پذیرنده (MID)

source: Private Key
fa_ir: کلید خصوصی

source: Woocommerce Gateway
fa_ir: درگاه ووکامرس
